osugiw/stm32-experiments/i2c-g070rb-g031/i2c-master-g070rb/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#define buttonState HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13)

// Slave address
#define G031_ADDR 0x20<<1

// ASCII Character
#define charA 			0x61
#define charB 			0x62
#define charC 			0x63
#define charD 			0x64
#define charE 			0x65
#define charF 			0x66
#define charG 			0x67
#define charH 			0x68
#define charI 			0x69
#define charJ 			0x6A
#define charK 			0x6B
#define charL 			0x6C
#define charM 			0x6D
#define charN 			0x6E
#define charO 			0x6F
#define charP 			0x70
#define charQ 			0x71
#define charR 			0x72
#define charS 			0x73
#define charT 			0x74
#define charU 			0x75
#define charV 			0x76
#define charW 			0x77
#define charX 			0x78
#define charY 			0x79
#define charZ 			0x7a
#define charSpace 	0x20


/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BluePB_Pin GPIO_PIN_13
#define BluePB_GPIO_Port GPIOC
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOF
#define LED_GREEN_Pin GPIO_PIN_5
#define LED_GREEN_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
